Tekla Open API Reference for Tekla Structures 2025
BaseWeld.GetSolid Method
 Method for getting the weld solid.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Solid GetSolid()
Public Function GetSolid As Solid
Return Value
Type: Solid
Weld solid.
See Also
Reference
BaseWeld Class
Tekla.Structures.Model Namespace